app/Services/AssignExamService.php

select * from `courses` order by `created_at` desc
---
    public function GetAllCourse()
    {
        return Course::latest()->get();

select * from `subjects` order by `created_at` desc
---
    public function GetAllSubjet()
    {
        return Subject::latest()->get();

select * from `batches` order by `created_at` desc
---
    public function GetAllBatch()
    {
        return Batch::latest()->get();

select * from `assign_exams` where `assign_exams`.`id` = '2' limit 1
select * from `batches` where `batches`.`id` in (1)
select * from `courses` where 0 = 1
select * from `subjects` where `subjects`.`id` in (1)
---
    public function editAssignExam($AssignId)
    {

         return AssignExam::with(['course', 'subject', 'batch'])->findOrFail($AssignId);