app/Services/CourseService.php

select * from `courses` where `courses`.`id` = '2' limit 1
---
    public function editCourse($SubjectId)
    {
        return Course::findOrFail($SubjectId);