app/Services/McqService.php

insert into `mcqs` (`module_id`, `question`, `updated_at`, `created_at`) values (0, 'f', '2024-12-15 05:40:47', '2024-12-15 05:40:47')
insert into `mcq_options` (`mcq_id`, `option_text`, `is_correct`, `updated_at`, `created_at`) values (5, 'f', 1, '2024-12-15 05:40:47', '2024-12-15 05:40:47')
---
    public function McqStore($request)
    {
        // Save the MCQ
        $mcq = Mcq::create([
            'module_id' => 0,
            'question' => $request->question,
        ]);

        // Save the options
        foreach ($request->options as $key => $option) {
            mcq_options::create([
                'mcq_id' => $mcq->id,
                'option_text' => $option,
                'is_correct' => $option === $request->correct_answer,
            ]);

select * from `mcq_options` where `mcq_options`.`mcq_id` in (3)
select * from `mcqs` where `mcqs`.`id` = '3' limit 1
---
        public function editMcq($mcqId)
    {
        return Mcq::with('options')->findOrFail($mcqId);