app/Services/moduleMcqService.php

insert into `module_mcqs` (`moduleName`, `updated_at`, `created_at`) values ('Final Exam', '2024-12-03 05:40:41', '2024-12-03 05:40:41')
---
    public function moduleMcqStore($request)
    {
        // Save the subject
        $module = new moduleMcq();
        $module->moduleName = $request->moduleName;
        $module->save();