app/Services/PackageService.php

    public function getAllPackages()
    {
        return Package::latest()->with('course:id,Course_name')->get();
---
select * from `packages` order by `created_at` desc
select `id`, `Course_name` from `courses` where `courses`.`id` in (2)

    public function editPackage($packageId)
    {
        return Package::findOrFail($packageId);
---
select * from `packages` where `packages`.`id` = '1' limit 1

    public function storePackage(array $data)
    {

        $requestAmount = $data['price'];
        if ($data['discount_percent']) {
            if (strpos($data['discount_percent'], '%') !== false) {
                $percentage = (float) str_replace('%', '', $data['discount_percent']);
                $discountAmount = ($percentage / 100) * $requestAmount;
            } else {
                $discountAmount = $data['discount_percent'];
            }
        } else {
            $discountAmount = 0;
        }

        $totalAmount = $requestAmount - $discountAmount;
        $data['final_price'] = $totalAmount;
        $data['course_id'] = $data['course_id'];
        $data['feature'] = json_encode($data['feature']);
        $data['batch'] = json_encode($data['batch']);
        $data['start_time'] = json_encode($data['start_time']);
        $data['end_time'] = json_encode($data['end_time']);
        $data['days'] = json_encode($data['days']);
        return Package::create($data);
---
insert into `packages` (`course_id`, `short_title`, `price`, `discount_percent`, `subject_id`, `batch_id`, `feature`, `start_time`, `end_time`, `days`, `details`, `user_id`, `final_price`, `updated_at`, `created_at`) values ('2', 'sd', '4', '4', '[\"1\"]', '[\"1\"]', '[\"dfg\"]', '[\"08:00\"]', '[\"17:00\"]', '[\"sunday\"]', 'Details', 1, 0, '2025-01-02 05:32:16', '2025-01-02 05:32:16')