app/Http/Controllers/assignmentController.php

select * from `assignments`
---
    public function index()
    {
        $data['page_title'] = "Assignment List";
        $data['assignments']= Assignment::with(['subject', 'batch'])->get();