app/Http/Controllers/AssignExamController.php

select * from `assign_exams`
---
    public function Index()
    {
        $data['page_title'] = "Assign Exam List";
        $data['AssignExam'] = AssignExam::all();

select * from `mcq_options` where `mcq_options`.`mcq_id` in (1)
select count(*) as aggregate from `mcqs`
---
    public function create(Request $request)
    {
        $data['page_title'] = "Exam Create";
        $data['Course'] = $this->AssignExamService->GetAllCourse();
        $data['Subject'] = $this->AssignExamService->GetAllSubjet();
        $data['Batch'] = $this->AssignExamService->GetAllBatch();
        $data['Mcq'] = Mcq::with('options')->paginate(50);

select * from `assign_exams` where `assign_exams`.`id` = '2' limit 1
select * from `mcqs` where `id` in ('1', '3')
select * from `mcq_options` where `mcq_options`.`mcq_id` in (1, 2, 3)
select * from `mcqs` limit 50 offset 0
select count(*) as aggregate from `mcqs`
---
    public function edit($AssignExamId)
    {

        $assignDetails =  AssignExam::findOrFail($AssignExamId);


        $questionIds = json_decode($assignDetails->question, true);

        $data['IdsForAfterSelected'] = json_decode($assignDetails->question, true);

        // Query the `mcqs` table for the corresponding questions
        $data['questions'] = DB::table('mcqs')->whereIn('id', $questionIds)->get();


        $data['page_title'] = "Exam UPdate";
        $data['Course'] = $this->AssignExamService->GetAllCourse();
        $data['Subject'] = $this->AssignExamService->GetAllSubjet();
        $data['Batch'] = $this->AssignExamService->GetAllBatch();
        $data['Mcq'] = Mcq::with('options')->paginate(50);

select * from `assign_exams` where `assign_exams`.`id` = '4' limit 1
delete from `assign_exams` where `id` = 4
---
    public function destroy($id)
    {
        $AssignExam = AssignExam::find($id);
        if ($AssignExam) {
            $AssignExam->delete();