app/Http/Controllers/BatchController.php

select * from `batches`
---
    public function Index(){
        $data['page_title'] = "Batch List";
        $data['batchs'] = Batch::all();

insert into `batches` (`batch_name`, `updated_at`, `created_at`) values ('asdf', '2024-11-26 04:42:53', '2024-11-26 04:42:53')
---
    public function store(BatchRequest $request){
        // Save the subject
        Batch::create([
            'batch_name' => $request->batchName,
        ]);