app/Http/Controllers/CourseController.php

    public function Index(){
        $data['page_title'] = "Course List";
        $data['Course'] = Course::all();
---
select * from `courses`