app/Http/Controllers/ExamController.php

    public function showIndex()
    {
        $data['page_title'] = "Exam List";
        $user_id = auth()->user()->id;

        // Fetch answers and group them by exam_name_id
        $answers = StudentAnswer::with('question', 'examName', 'option')
            ->where('student_id', $user_id)
            ->get()
            ->groupBy('exam_name_id');
---
select * from `student_answers` where `student_id` = 8