app/Http/Controllers/HomeController.php

    public function dashboard()
    {
        $data['page_title'] = "Dashboard";
        $data['total_order'] = Order::count('id');
---
select count(`id`) as aggregate from `orders`

    public function orderSubmit(OrderRequest $request)
    {
        $in     = $request->all();
        $in['total_amount'] = str_replace(',', '',$in['total_amount']);
        $user   = User::findOrFail($request->user_id);
---
select * from `users` where `users`.`id` = '8' limit 1

    public function userParymentNagadSucess(Request $request){

        $orderId = $request->order_id;
        Order::find($orderId)->update([
            'payment_method'=>"nagad",
            'transaction_id'=> $request->transtionId,
        ]);
---
select * from `nagads` where `nagads`.`id` = 1 limit 1

    public function userParymentBankSucess(Request $request){

        $orderId = $request->order_id;
        // $imageName = time() . '.' . $request->slip_image->extension();
        // $request->slip_image->move(public_path('upload/payment/bank'), $imageName);
        Order::find($orderId)->update([
            'payment_method'=>"Cash",
            'transaction_id'=> $request->transtionId,
            // 'slip_image'=> $imageName,
        ]);
        $order_id = Order::where('id', $orderId)->first();
        transactions::insert([

            'order_id' => $order_id->id,
            'credit' => $order_id->total_amount,
            'created_at' => Carbon::now(),
        ]);
---
select * from `orders` where `orders`.`id` = '23' limit 1
select * from `orders` where `id` = '23' limit 1
insert into `transactions` (`order_id`, `credit`, `created_at`) values (23, 5, '2024-12-07 05:14:47')

    public function orderPdf($orderId)
    {
        $invoice = Order::where('id',$orderId)->latest()->first();
---
select * from `orders` where `id` = '23' order by `created_at` desc limit 1

    public function OrderStatusUpdate($id, Request $request)
    {
        // Retrieve the status from the request
        $status = $request->input('status');

        // Update the order status
        $order = Order::find($id);
        if ($order) {
            $order->update([
                'status' => $status,
            ]);
---
select * from `orders` where `orders`.`id` = '6' limit 1
update `orders` set `status` = 'confirm', `orders`.`updated_at` = '2025-01-02 05:54:57' where `id` = 6