app/Http/Controllers/MCQExamController.php

    public function Index()
    {
        $data['page_title'] = "MCQ List";
        $data['Mcq'] = Mcq::with('options')->get();
---
select * from `mcq_options` where `mcq_options`.`mcq_id` in (1, 2, 3)
select * from `mcqs`