app/Http/Controllers/moduleAssignController.php

    public function create(Request $request)
    {
        $data['page_title'] = "Module Assign Create";
        $data['modules'] = moduleMcq::all();
        $data['AssignExam'] = AssignExam::all();
---
select * from `assign_exams`