app/Http/Controllers/SubjectController.php

select * from `subjects`
---
    public function Index(){
        $data['page_title'] = "Subject List";
        $data['subjects'] = Subject::all();

insert into `subjects` (`subject_name`, `updated_at`, `created_at`) values ('sdfg', '2024-11-26 04:42:41', '2024-11-26 04:42:41')
---
    public function store(Request $request){

        $request->validate([
            'subject_name' => 'required|string|max:255',
        ]);

        // Save the subject
        Subject::create([
            'subject_name' => $request->subject_name,
        ]);